---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.PanelsSlightlyMalformedWarning
source: html/8aba2103-1930-9661-4fce-faf915ac8e87.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.PanelsSlightlyMalformedWarning Property

Some panels in this curtain system are slightly malformed.
 The problem is most likely ignorable. This problem usually occurs when a panel or parts of a panel have
 been divided so that they are very narrow. To better see the malformed panels, temporarily hide the mullion
 category and set display of lines to ""thin lines"" (using the command on the view menu).

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelsSlightlyMalformedWarning { get; }
```